# set supported repositories for brew to pull from
tap "homebrew/bundle"
tap "homebrew/cask-fonts"

# fonts
cask "font-hack-nerd-font"

# apps
cask "1password"
cask "1password-cli"
cask "android-studio"
cask "cleanshot"
cask "cyberduck"
cask "discord"
cask "docker"
cask "figma"
cask "firefox"
# cask "google-chrome"
cask "ipfs"
cask "linear-linear"
cask "loom"
cask "ngrok"
cask "notion"
cask "numi"
cask "postman"
cask "raycast"
cask "redisinsight"
cask "slack"
cask "spotify"
cask "tableplus"
cask "visual-studio-code"
cask "warp"
cask "zoom"

# packages
brew "cloud-nuke"
brew "curl"
brew "direnv"
brew "docker-credential-helper-ecr"
brew "gh"
brew "gnupg"
brew "imagemagick"
brew "jq"
brew "magic-wormhole"
brew "mas"
brew "mise"
brew "mkcert"
brew "nss"

# versioned packages (should these be pulled out into install-languages)
brew "awscli"
brew "deno"
brew "protobuf"


# NOTE: install apps through the mac app store - this is only used when items
# cannot be installed through as cask.
# NOTE: This does not currently work due to known issues with mas and items that
# need to be purchased. Leaving here to reference of what shoiuld be installed.
# mas "ColorSlurp", id: 1287239339
# mas "Dato", id: 1470584107
# mas "LimeChat", id: 414030210
# mas "Twingate", id: 1501592214

# vscode extensions (I do not believe this is necessary as we have vscode sync)
# vscode "alefragnani.project-manager"
# vscode "amazonwebservices.aws-toolkit-vscode"
# vscode "buenon.scratchpads"
# vscode "dbaeumer.vscode-eslint"
# vscode "denoland.vscode-deno"
# vscode "dracula-theme.theme-dracula"
# vscode "eamodio.gitlens"
# vscode "earthly.earthfile-syntax-highlighting"
# vscode "EditorConfig.EditorConfig"
# vscode "esbenp.prettier-vscode"
# vscode "GitHub.codespaces"
# vscode "GitHub.copilot"
# vscode "GitHub.remotehub"
# vscode "github.vscode-github-actions"
# vscode "GitHub.vscode-pull-request-github"
# vscode "IBM.output-colorizer"
# vscode "JuanBlanco.solidity"
# vscode "mariomatheu.syntax-project-pbxproj"
# vscode "mrmlnc.vscode-duplicate"
# vscode "ms-azuretools.vscode-docker"
# vscode "ms-python.isort"
# vscode "ms-python.python"
# vscode "ms-python.vscode-pylance"
# vscode "ms-toolsai.jupyter"
# vscode "ms-toolsai.jupyter-keymap"
# vscode "ms-toolsai.jupyter-renderers"
# vscode "ms-toolsai.vscode-jupyter-cell-tags"
# vscode "ms-toolsai.vscode-jupyter-slideshow"
# vscode "ms-vscode-remote.remote-containers"
# vscode "ms-vscode-remote.remote-ssh"
# vscode "ms-vscode-remote.remote-ssh-edit"
# vscode "ms-vscode.azure-repos"
# vscode "ms-vscode.makefile-tools"
# vscode "ms-vscode.remote-explorer"
# vscode "ms-vscode.remote-repositories"
# vscode "ms-vscode.test-adapter-converter"
# vscode "naumovs.color-highlight"
# vscode "nrwl.angular-console"
# vscode "Orta.vscode-jest"
# vscode "peakchen90.open-html-in-browser"
# vscode "PKief.material-icon-theme"
# vscode "redhat.vscode-yaml"
# vscode "Rubymaniac.vscode-direnv"
# vscode "SimonSiefke.svg-preview"
# vscode "streetsidesoftware.code-spell-checker"
# vscode "task.vscode-task"
# vscode "ZixuanChen.vitest-explorer"
